# Analyses in R Final Project

### load packages

In [1]:
library("dplyr")
library("car")
library("rcompanion")
library("IDPmisc")

Attaching package: 'dplyr'


The following objects are masked from 'package:stats':

    filter, lag


The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union


Warning message:
"package 'car' was built under R version 4.1.3"
Loading required package: carData

Warning message:
"package 'carData' was built under R version 4.1.3"

Attaching package: 'car'


The following object is masked from 'package:dplyr':

    recode


Warning message:
"package 'rcompanion' was built under R version 4.1.3"

In [2]:
apps = read.csv('../Data/cleanMerge1.csv')

# Data Wrangling

In [3]:
head(apps)

  X  ID      gender ownsCar ownsRealty numChildren totalIncome incomeType
1  0 5008804 M      Y       Y          0           427500      Working
2 15 5008804 M      Y       Y          0           427500      Working
3 14 5008804 M      Y       Y          0           427500      Working
4 13 5008804 M      Y       Y          0           427500      Working
5 12 5008804 M      Y       Y          0           427500      Working
6 10 5008804 M      Y       Y          0           427500      Working
  eduLvl           famStatus      housingType      occupation     famSize
1 Higher education Civil marriage Rented apartment Not identified 2
2 Higher education Civil marriage Rented apartment Not identified 2
3 Higher education Civil marriage Rented apartment Not identified 2
4 Higher education Civil marriage Rented apartment Not identified 2
5 Higher education Civil marriage Rented apartment Not identified 2
6 Higher education Civil marriage Rented apartment Not identified 2
  ageYrs yrsEmpl UNEMPLOYED ApprStatus
1 33     12      1          1
2 33     12      1          1
3 33     12      1          1
4 33     12      1          1
5 33     12      1          1
6 33     12      1          1

In [12]:
head(apps2)

  ID      gender ownsCar ownsRealty numChildren totalIncome
1 5008804 M      Y       Y          0           427500
2 5008805 M      Y       Y          0           427500
3 5008806 M      Y       Y          0           112500
4 5008808 F      N       Y          0           270000
5 5008809 F      N       Y          0           270000
6 5008810 F      N       Y          0           270000
  incomeType           eduLvl                        famStatus
1 Working              Higher education              Civil marriage
2 Working              Higher education              Civil marriage
3 Working              Secondary / secondary special Married
4 Commercial associate Secondary / secondary special Single / not married
5 Commercial associate Secondary / secondary special Single / not married
6 Commercial associate Secondary / secondary special Single / not married
  housingType       daysBirth daysEmpl occupation     famSize
1 Rented apartment  -12005    -4542                   2
2 Rented apartment  -12005    -4542                   2
3 House / apartment -21474    -1134    Security staff 2
4 House / apartment -19110    -3051    Sales staff    1
5 House / apartment -19110    -3051    Sales staff    1
6 House / apartment -19110    -3051    Sales staff    1

# One Way Between Subjects ANOVA

In [ ]:
# Is there a difference in income among all categories of occupation type?

In [17]:
# Normality of the DV (totalIncome)
plotNormalHistogram(apps3$AMT_INCOME_TOTAL)

Warning message in min(x):
"no non-missing arguments to min; returning Inf"
Warning message in max(x):
"no non-missing arguments to max; returning -Inf"

ERROR: Error in seq.default(min(x), max(x), length = length): 'from' must be a finite number

In [18]:
# try sqrt due to slight positive skew
apps3$AMT_INCOME_TOTALSQRT <- sqrt(apps3$AMT_INCOME_TOTAL)

ERROR: Error in sqrt(apps3$AMT_INCOME_TOTAL): non-numeric argument to mathematical function

In [ ]:
plotNormalHistogram(apps3$AMT_INCOME_TOTALSQRT)

In [ ]:
# homogeneity of variance - bartlett's test
bartlett.test(AMT_INCOME_TOTALSQRT~OCCUPATION_TYPE, data = apps3)

In [ ]:
## Since p val is <.05, this assumption fails.

In [ ]:
# Is there a difference in income among all categories of family status type?

In [ ]:
unique(apps3$NAME_FAMILY_STATUS)

In [ ]:
# homogeneity of variance - bartlett's test
bartlett.test(AMT_INCOME_TOTALSQRT~NAME_FAMILY_STATUS, data = apps3)

In [ ]:
# Is there a difference in income among all categories of HOUSING type?

In [ ]:
bartlett.test(AMT_INCOME_TOTALSQRT~NAME_HOUSING_TYPE, data = apps3)

In [ ]:
# Is there a difference in income among all categories of EDUCATION type?

In [ ]:
bartlett.test(AMT_INCOME_TOTALSQRT~NAME_EDUCATION_TYPE, data = apps2)

In [ ]:
# Is there a difference in income among all categories of INCOME type?

In [ ]:
bartlett.test(AMT_INCOME_TOTALSQRT~NAME_INCOME_TYPE, data = apps2)

### the DV (total income) has a normal distribution, but none of the categorical variables in this dataset pass the assumption of homogeneity as it pertains to total income.  Therefore, ANOVAs and MANOVAs cannot be followed through with with the expectations of receiving accurate conclusions.

In [ ]:
#